[
    "If it hurts, do it more often.",
    "Adding manpower to a late software project makes it later!",
    "The first 90 percent of the code accounts for the first 90 percent of the development time...The remaining 10 percent of the code accounts for the other 90 percent of the development time.",
    "Any fool can write code that a computer can understand. Good programmers write code that humans can understand.",
    "Premature optimization is the root of all evil.",
    "Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it.",
    "Programming without an extremely heavy use of console.log is same as if a doctor would refuse to use x-rays or blood tests when diagnosing patients.",
    "The only way to go fast, is to go well.",
    "There are only two hard things in computer science: cache invalidation, naming things, and off-by-one errors.",
    "It’s not a bug – it’s an undocumented feature.",
    "Simplicity is the soul of efficiency.",
    "Good code is its own best documentation.",
    "In theory, there is no difference between theory and practice. But, in practice, there is.",
    "Any sufficiently advanced technology is indistinguishable from magic.",
    "The best way to predict the future is to invent it.",
    "Software is like gardening. You never stop pruning.",
    "It’s not the bug, it’s the feature.",
    "If you’re not testing, you’re not developing.",
    "Testing is a key to success in programming.",
    "The best code is no code at all.",
    "Debugging is like being the detective in a criminal movie where you are also the murderer.",
    "When in doubt, use brute force.",
    "First, solve the problem. Then, write the code.",
    "Code never lies, comments sometimes do.",
    "Programs must be written for people to read, and only incidentally for machines to execute.",
    "There are only two hard things in software engineering: cache invalidation and naming things.",
    "Code is like humor. When you have to explain it, it’s bad.",
    "Before software can be reusable, it first has to be usable.",
    "If debugging is the process of removing software bugs, then programming must be the process of putting them in.",
    "A programming language is low-level when its programs require attention to the irrelevant.",
    "Good code is its own best documentation.",
    "The most effective debugging tool is still careful thought, coupled with judiciously placed print statements.",
    "Computers are fast; programmers keep it slow.",
    "Optimization hinders readability.",
    "Beware of bugs in the above code; I have only proved it correct, not tried it.",
    "To understand recursion, you must first understand recursion.",
    "The code is testing the developer as much as the developer is testing the code.",
    "An API that is simple is always better than an API that is complicated.",
    "Programming isn’t about what you know; it’s about what you can figure out.",
    "There are only two hard things in computer science: naming things, cache invalidation, and off-by-one errors.",
    "The worst thing you can do with a program is not write it.",
    "In programming, the hard part isn’t solving problems, but deciding what problems to solve.",
    "The sooner you start to code, the longer the program will take.",
    "It’s not that we use technology, we live technology.",
    "Software development is like solving a puzzle, the bigger the puzzle, the more tools you need to solve it.",
    "Adding features without thinking of the end user is how you create terrible software.",
    "Good programmers write code that humans can understand.",
    "A good programmer is someone who always looks both ways before crossing a one-way street.",
    "The problem is not the solution. The problem is the question.",
    "The programmer’s wife tells him: “You are always solving the wrong problem.”",
    "The function of good software is to make the complex appear to be simple.",
    "The best part about programming is the debugging process.",
    "Simplicity is the ultimate sophistication.",
    "Computers make very fast, very accurate mistakes.",
    "When you optimize code for the sake of optimization, it is very easy to make it more complicated than it needs to be.",
    "The best thing about a Boolean is even if you are wrong, you are only off by a bit.",
    "The more I learn, the more I realize how little I know.",
    "Software is eating the world.",
    "Don’t worry if it’s not perfect. Just get it working.",
    "Coding is not just about making the computer understand you. It’s about making people understand you.",
    "The key to understanding code is learning how to think about it.",
    "The real problem with programming is not writing the code, it’s understanding the requirements.",
    "There are two ways to write error-free programs; only the third one works.",
    "A computer program does what you tell it to do, not what you want it to do.",
    "In programming, there’s no such thing as a perfect code, only better code.",
    "Your code should tell a story.",
    "A good programmer is someone who looks at their code and sees beauty.",
    "Think twice, code once."
  ]
  